import os

dict_english = [
    "Settings", "Profile", "Home", "Analytics", "Reports",
    "App Language", "System & Security", "Push Notifications",
    "Biometric Lock", "Haptic Feedback", "Data Management",
    "Auto-Sync Records", "Location Services", "About Application",
    "App Version", "Privacy Policy", "Delete Account",
    "Log Out", "Edit Profile", "Help & Support", "Notifications",
    "Select Language", "Animals", "Scans", "Health", "User", "Member"
]

dict_hindi = [
    "सेटिंग्स", "प्रोफ़ाइल", "होम", "एनालिटिक्स", "रिपोर्ट्स",
    "ऐप की भाषा", "सिस्टम और सुरक्षा", "पुश सूचनाएँ",
    "बायोमेट्रिक लॉक", "हैटिक फीडबैक", "डेटा प्रबंधन",
    "ऑटो-सिंक रिकॉर्ड्स", "स्थान सेवाएँ", "ऐप के बारे में",
    "ऐप संस्करण", "गोपनीयता नीति", "खाता हटाएं",
    "लॉग आउट", "प्रोफ़ाइल संपादित करें", "सहायता और समर्थन", "सूचनाएँ",
    "भाषा चुनें", "पशु", "स्कैन", "स्वास्थ्य", "उपयोगकर्ता", "सदस्य"
]

dict_telugu = [
    "సెట్టింగ్‌లు", "ప్రొఫైల్", "హోమ్", "విశ్లేషణలు", "నివేదికలు",
    "యాప్ భాష", "సిస్టమ్ & భద్రత", "పుష్ నోటిఫికేషన్‌లు",
    "బయోమెట్రిక్ లాక్", "హాప్టిక్ ఫీడ్‌బ్యాక్", "డేటా నిర్వహణ",
    "ఆటో-సింక్ రికార్డులు", "స్థాన సేవలు", "అనువర్తనం గురించి",
    "యాప్ వెర్షన్", "గోప్యతా విధానం", "ఖాతాను తొలగించు",
    "లాగ్ అవుట్", "ప్రొఫైల్ సవరించండి", "సహాయం & మద్దతు", "నోటిఫికేషన్‌లు",
    "భాషను ఎంచుకోండి", "జంతువులు", "స్కాన్లు", "ఆరోగ్యం", "వినియోగదారు", "సభ్యుడు"
]

dict_tamil = [
    "அமைப்புகள்", "சுயவிவரம்", "முகப்பு", "பகுப்பாய்வு", "அறிக்கைகள்",
    "பயன்பாட்டு மொழி", "அமைப்பு மற்றும் பாதுகாப்பு", "புஷ் அறிவிப்புகள்",
    "பயோமெட்ரிக் பூட்டு", "ஹாப்டிக் கருத்து", "தரவு மேலாண்மை",
    "தானியங்கு-ஒத்திசைவு பதிவுகள்", "இருப்பிட சேவைகள்", "பயன்பாடு பற்றி",
    "பயன்பாட்டு பதிப்பு", "தனியுரிமைக் கொள்கை", "கணக்கை நீக்கு",
    "வெளியேறு", "சுயவிவரத்தை திருத்து", "உதவி மற்றும் ஆதரவு", "அறிவிப்புகள்",
    "மொழியைத் தேர்ந்தெடுக்கவும்", "விலங்குகள்", "ஸ்கேன்கள்", "ஆரோக்கியம்", "பயனர்", "உறுப்பினர்"
]

dict_kannada = [
    "ಸೆಟ್ಟಿಂಗ್‌ಗಳು", "ಪ್ರೊಫೈಲ್", "ಮುಖಪುಟ", "ವಿಶ್ಲೇಷಣೆ", "ವರದಿಗಳು",
    "ಅಪ್ಲಿಕೇಶನ್ ಭಾಷೆ", "ಸಿಸ್ಟಮ್ ಮತ್ತು ಭದ್ರತೆ", "ಪುಶ್ ಅಧಿಸೂಚನೆಗಳು",
    "ಬಯೋಮೆಟ್ರಿಕ್ ಲಾಕ್", "ಹ್ಯಾಪ್ಟಿಕ್ ಪ್ರತಿಕ್ರಿಯೆ", "ಡೇಟಾ ನಿರ್ವಹಣೆ",
    "ಆಟೋ-ಸಿಂಕ್ ದಾಖಲೆಗಳು", "ಸ್ಥಳ ಸೇವೆಗಳು", "ಅಪ್ಲಿಕೇಶನ್ ಬಗ್ಗೆ",
    "ಅಪ್ಲಿಕೇಶನ್ ಆವೃತ್ತಿ", "ಗೌಪ್ಯತೆ ನೀತಿ", "ಖಾತೆಯನ್ನು ಅಳಿಸಿ",
    "ಲಾಗ್ ಔಟ್", "ಪ್ರೊಫೈಲ್ ಸಂಪಾದಿಸಿ", "ಸಹಾಯ ಮತ್ತು ಬೆಂಬಲ", "ಅಧಿಸೂಚನೆಗಳು",
    "ಭಾಷೆಯನ್ನು ಆಯ್ಕೆ ಮಾಡಿ", "ಪ್ರಾಣಿಗಳು", "ಸ್ಕ್ಯಾನ್‌ಗಳು", "ಆರೋಗ್ಯ", "ಬಳಕೆದಾರ", "ಸದಸ್ಯ"
]

langs = {
    "en": dict_english,
    "hi": dict_hindi,
    "te": dict_telugu,
    "ta": dict_tamil,
    "kn": dict_kannada
}

for code, translated in langs.items():
    file_path = f"BSAI/{code}.lproj/Localizable.strings"
    with open(file_path, "w") as f:
        for en_key, tr_val in zip(dict_english, translated):
            f.write(f'"{en_key}" = "{tr_val}";\n')
